FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/сфпПравилаЗаписиТелефонныхПереговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>сфпПравилаЗаписиТелефонныхПереговоров</Name>
			<Comment>Правила записи телефонных переговоров</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВнТелефона</Name>
					<Comment>Номер внутреннего телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Comment>Контакт</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/сфпПравилаЗаписиТелефонныхПереговоров/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ЭтаФорма.ОтборПоПользователю) ИЛИ ЗначениеЗаполнено(ЭтаФорма.ОтборПоКонтакту) Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ОтборПоПользователю) Тогда
			ПараметрыФормы.Вставить("ОтборПоПользователю", ЭтаФорма.ОтборПоПользователю);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ЭтаФорма.ОтборПоКонтакту) Тогда
			ПараметрыФормы.Вставить("ОтборПоКонтакту", ЭтаФорма.ОтборПоКонтакту);
		КонецЕсли;	
	ИначеЕсли Копирование Тогда
		ТД = Элементы.Список.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТД.Пользователь) Тогда
			ПараметрыФормы.Вставить("Пользователь", ТД.Пользователь);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТД.Контакт) Тогда
			ПараметрыФормы.Вставить("Контакт", ТД.Контакт);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТД.НомерВнТелефона) Тогда
			ПараметрыФормы.Вставить("НомерВнТелефона", ТД.НомерВнТелефона);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТД.НомерТелефона) Тогда
			ПараметрыФормы.Вставить("НомерТелефона", ТД.НомерТелефона);
		КонецЕсли;	
	Иначе		
		Возврат;		
	КонецЕсли;	
	Отказ = Истина;
	ФормаЗаписи = ПолучитьФорму("РегистрСведений.сфпПравилаЗаписиТелефонныхПереговоров.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
	ФормаЗаписи.Открыть();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПользователю(Пользователь)
	ЭлементыОтбора = Список.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Представление = "ОтборПоПользователю" Тогда
			Если ЗначениеЗаполнено(Пользователь) Тогда
				ЭлементОтбора.ПравоеЗначение = Пользователь;
				ЭлементОтбора.Использование = Истина;
			Иначе
				ЭлементОтбора.Использование = Ложь;
			КонецЕсли;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьОтборПоКонтакту(Контакт)
	ЭлементыОтбора = Список.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Представление = "ОтборПоКонтакту" Тогда
			Если ЗначениеЗаполнено(Контакт) Тогда
				ЭлементОтбора.ПравоеЗначение = Контакт;
				ЭлементОтбора.Использование = Истина;
			Иначе
				ЭлементОтбора.Использование = Ложь;
			КонецЕсли;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ сфпСофтФонПроСервер.сфпИспользоватьЗаписьПереговоров() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ЭтаФорма.ТолькоПросмотр	= НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ДобавлениеИзменениеПользователей"));
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПользователюПриИзменении(Элемент)
	УстановитьОтборПоПользователю(ЭтаФорма.ОтборПоПользователю);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКонтактуПриИзменении(Элемент)
	Если (ЭтаФорма.ОтборПоКонтакту = Неопределено) ИЛИ ЗначениеЗаполнено(ЭтаФорма.ОтборПоКонтакту) Тогда
		УстановитьОтборПоКонтакту(ЭтаФорма.ОтборПоКонтакту);
	КонецЕсли;	
КонецПроцедуры
